export const mockPosts = [
  {
    id: 9,
    link: ['https://dl2.reactdeveloper.ir/demo/chat.mp4'],
    // link: [
    //   'http://dl.reactdeveloper.ir/p51573000180009/part5-react-js-ecmascript-p1.mp4'
    // ],
    location: 'Iran,Tehran',
    type: 'MGVideo',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 1,
    link: ['https://picsum.photos/200', 'https://picsum.photos/205'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 2,
    link: ['https://picsum.photos/280'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 3,
    link: ['https://picsum.photos/210'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 4,
    link: ['https://picsum.photos/220'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 5,
    link: ['https://picsum.photos/230'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 6,
    link: ['https://picsum.photos/240'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 7,
    link: ['https://picsum.photos/260'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  },
  {
    id: 8,
    link: ['https://picsum.photos/270'],
    type: 'img/png',
    location: 'Iran,Tehran',
    description:
      'این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند…'
  }
]
